hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/RF_LIB/inc/hw_ddi.h
//*****************************************************************************
//
// The following are defines pseudo-magic numbers that should go away.
// New code should not use these registers and old code should be ported
// to not use these.
//
//*****************************************************************************
#define DDI_O_DIR03             0x00000000  // Direct access for DDI byte
                                            // offsets 0 to 3
#define DDI_O_DIR47             0x00000004  // Direct access for DDI byte
                                            // offsets 4 to 7
#define DDI_O_DIR811            0x00000008  // Direct access for DDI byte
                                            // offsets 8 to 11
#define DDI_O_DIR1215           0x0000000C  // Direct access for DDI byte
                                            // offsets 12 to 15
#define DDI_O_DIR1619           0x00000010  // Direct access for DDI byte
                                            // offsets 16 to 19
#define DDI_O_DIR2023           0x00000014  // Direct access for DDI byte
                                            // offsets 20 to 23
#define DDI_O_DIR2427           0x00000018  // Direct access for DDI byte
                                            // offsets 24 to 27
#define DDI_O_DIR2831           0x0000001C  // Direct access for DDI byte
                                            // offsets 28 to 31
#define DDI_O_DIR3235           0x00000020  // Direct access for DDI byte
                                            // offsets 32 to 35
#define DDI_O_DIR3639           0x00000024  // Direct access for DDI byte
                                            // offsets 36 to 39
#define DDI_O_DIR4043           0x00000028  // Direct access for DDI byte
                                            // offsets 40 to 43
#define DDI_O_DIR4447           0x0000002C  // Direct access for DDI byte
                                            // offsets 44 to 47
#define DDI_O_DIR4851           0x00000030  // Direct access for DDI byte
                                            // offsets 48 to 51
#define DDI_O_DIR5255           0x00000034  // Direct access for DDI byte
                                            // offsets 52 to 55
#define DDI_O_DIR5659           0x00000038  // Direct access for DDI byte
                                            // offsets 56 to 59
#define DDI_O_DIR6063           0x0000003C  // Direct access for DDI byte
                                            // offsets 60 to 63
#define DDI_O_SET03             0x00000040  // Set register for DDI byte
                                            // offsets 0 to 3
#define DDI_O_SET47             0x00000044  // Set register for DDI byte
                                            // offsets 4 to 7
#define DDI_O_SET811            0x00000048  // Set register for DDI byte
                                            // offsets 8 to 11
#define DDI_O_SET1215           0x0000004C  // Set register for DDI byte
                                            // offsets 12 to 15
#define DDI_O_SET1619           0x00000050  // Set register for DDI byte
                                            // offsets 16 to 19
#define DDI_O_SET2023           0x00000054  // Set register for DDI byte
                                            // offsets 20 to 23
#define DDI_O_SET2427           0x00000058  // Set register for DDI byte
                                            // offsets 24 to 27
#define DDI_O_SET2831           0x0000005C  // Set register for DDI byte
                                            // offsets 28 to 31
#define DDI_O_SET3235           0x00000060  // Set register for DDI byte
                                            // offsets 32 to 35
#define DDI_O_SET3639           0x00000064  // Set register for DDI byte
                                            // offsets 36 to 39
#define DDI_O_SET4043           0x00000068  // Set register for DDI byte
                                            // offsets 40 to 43
#define DDI_O_SET4447           0x0000006C  // Set register for DDI byte
                                            // offsets 44 to 47
#define DDI_O_SET4851           0x00000070  // Set register for DDI byte
                                            // offsets 48 to 51
#define DDI_O_SET5255           0x00000074  // Set register for DDI byte
                                            // offsets 52 to 55
#define DDI_O_SET5659           0x00000078  // Set register for DDI byte
                                            // offsets 56 to 59
#define DDI_O_SET6063           0x0000007C  // Set register for DDI byte
                                            // offsets 60 to 63
#define DDI_O_CLR03             0x00000080  // Clear register for DDI byte
                                            // offsets 0 to 3
#define DDI_O_CLR47             0x00000084  // Clear register for DDI byte
                                            // offsets 4 to 7
#define DDI_O_CLR811            0x00000088  // Clear register for DDI byte
                                            // offsets 8 to 11
#define DDI_O_CLR1215           0x0000008C  // Clear register for DDI byte
                                            // offsets 12 to 15
#define DDI_O_CLR1619           0x00000090  // Clear register for DDI byte
                                            // offsets 16 to 19
#define DDI_O_CLR2023           0x00000094  // Clear register for DDI byte
                                            // offsets 20 to 23
#define DDI_O_CLR2427           0x00000098  // Clear register for DDI byte
                                            // offsets 24 to 27
#define DDI_O_CLR2831           0x0000009C  // Clear register for DDI byte
                                            // offsets 28 to 31
#define DDI_O_CLR3235           0x000000A0  // Clear register for DDI byte
                                            // offsets 32 to 35
#define DDI_O_CLR3639           0x000000A4  // Clear register for DDI byte
                                            // offsets 36 to 39
#define DDI_O_CLR4043           0x000000A8  // Clear register for DDI byte
                                            // offsets 40 to 43
#define DDI_O_CLR4447           0x000000AC  // Clear register for DDI byte
                                            // offsets 44 to 47
#define DDI_O_CLR4851           0x000000B0  // Clear register for DDI byte
                                            // offsets 48 to 51
#define DDI_O_CLR5255           0x000000B4  // Clear register for DDI byte
                                            // offsets 52 to 55
#define DDI_O_CLR5659           0x000000B8  // Clear register for DDI byte
                                            // offsets 56 to 59
#define DDI_O_CLR6063           0x000000BC  // Clear register for DDI byte
                                            // offsets 60 to 63
#define DDI_O_MASK4B01          0x00000100  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 0 and
                                            // 1
#define DDI_O_MASK4B23          0x00000104  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 2 and
                                            // 3
#define DDI_O_MASK4B45          0x00000108  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 4 and
                                            // 5
#define DDI_O_MASK4B67          0x0000010C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 6 and
                                            // 7
#define DDI_O_MASK4B89          0x00000110  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 8 and
                                            // 9
#define DDI_O_MASK4B1011        0x00000114  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 10 and
                                            // 11
#define DDI_O_MASK4B1213        0x00000118  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 12 and
                                            // 13
#define DDI_O_MASK4B1415        0x0000011C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 14 and
                                            // 15
#define DDI_O_MASK4B1617        0x00000120  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 16 and
                                            // 17
#define DDI_O_MASK4B1819        0x00000124  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 18 and
                                            // 19
#define DDI_O_MASK4B2021        0x00000128  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 20 and
                                            // 21
#define DDI_O_MASK4B2223        0x0000012C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 22 and
                                            // 23
#define DDI_O_MASK4B2425        0x00000130  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 24 and
                                            // 25
#define DDI_O_MASK4B2627        0x00000134  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 26 and
                                            // 27
#define DDI_O_MASK4B2829        0x00000138  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 28 and
                                            // 29
#define DDI_O_MASK4B3031        0x0000013C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 30 and
                                            // 31
#define DDI_O_MASK4B3233        0x00000140  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 32 and
                                            // 33
#define DDI_O_MASK4B3435        0x00000144  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 34 and
                                            // 35
#define DDI_O_MASK4B3637        0x00000148  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 36 and
                                            // 37
#define DDI_O_MASK4B3839        0x0000014C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 38 and
                                            // 39
#define DDI_O_MASK4B4041        0x00000150  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 40 and
                                            // 41
#define DDI_O_MASK4B4243        0x00000154  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 42 and
                                            // 43
#define DDI_O_MASK4B4445        0x00000158  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 44 and
                                            // 45
#define DDI_O_MASK4B4647        0x0000015C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 46 and
                                            // 47
#define DDI_O_MASK4B4849        0x00000160  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 48 and
                                            // 49
#define DDI_O_MASK4B5051        0x00000164  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 50 and
                                            // 51
#define DDI_O_MASK4B5253        0x00000168  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 52 and
                                            // 53
#define DDI_O_MASK4B5455        0x0000016C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 54 and
                                            // 55
#define DDI_O_MASK4B5657        0x00000170  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 56 and
                                            // 57
#define DDI_O_MASK4B5859        0x00000174  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 58 and
                                            // 59
#define DDI_O_MASK4B6061        0x00000178  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 60 and
                                            // 61
#define DDI_O_MASK4B6263        0x0000017C  // Masked access (4m/4d) for DDI
                                            // Registers at byte offsets 62 and
                                            // 63
#define DDI_O_MASK8B01          0x00000180  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 0 and
                                            // 1
#define DDI_O_MASK8B23          0x00000184  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 2 and
                                            // 3
#define DDI_O_MASK8B45          0x00000188  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 4 and
                                            // 5
#define DDI_O_MASK8B67          0x0000018C  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 6 and
                                            // 7
#define DDI_O_MASK8B89          0x00000190  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 8 and
                                            // 9
#define DDI_O_MASK8B1011        0x00000194  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 10 and
                                            // 11
#define DDI_O_MASK8B1213        0x00000198  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 12 and
                                            // 13
#define DDI_O_MASK8B1415        0x0000019C  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 14 and
                                            // 15
#define DDI_O_MASK8B1617        0x000001A0  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 16 and
                                            // 17
#define DDI_O_MASK8B1819        0x000001A4  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 18 and
                                            // 19
#define DDI_O_MASK8B2021        0x000001A8  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 20 and
                                            // 21
#define DDI_O_MASK8B2223        0x000001AC  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 22 and
                                            // 23
#define DDI_O_MASK8B2425        0x000001B0  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 24 and
                                            // 25
#define DDI_O_MASK8B2627        0x000001B4  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 26 and
                                            // 27
#define DDI_O_MASK8B2829        0x000001B8  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 28 and
                                            // 29
#define DDI_O_MASK8B3031        0x000001BC  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 30 and
                                            // 31
#define DDI_O_MASK8B3233        0x000001C0  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 32 and
                                            // 33
#define DDI_O_MASK8B3435        0x000001C4  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 34 and
                                            // 35
#define DDI_O_MASK8B3637        0x000001C8  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 36 and
                                            // 37
#define DDI_O_MASK8B3839        0x000001CC  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 38 and
                                            // 39
#define DDI_O_MASK8B4041        0x000001D0  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 40 and
                                            // 41
#define DDI_O_MASK8B4243        0x000001D4  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 42 and
                                            // 43
#define DDI_O_MASK8B4445        0x000001D8  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 44 and
                                            // 45
#define DDI_O_MASK8B4647        0x000001DC  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 46 and
                                            // 47
#define DDI_O_MASK8B4849        0x000001E0  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 48 and
                                            // 49
#define DDI_O_MASK8B5051        0x000001E4  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 50 and
                                            // 51
#define DDI_O_MASK8B5253        0x000001E8  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 52 and
                                            // 53
#define DDI_O_MASK8B5455        0x000001EC  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 54 and
                                            // 55
#define DDI_O_MASK8B5657        0x000001F0  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 56 and
                                            // 57
#define DDI_O_MASK8B5859        0x000001F4  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 58 and
                                            // 59
#define DDI_O_MASK8B6061        0x000001F8  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 60 and
                                            // 61
#define DDI_O_MASK8B6263        0x000001FC  // Masked access (8m/8d) for DDI
                                            // Registers at byte offsets 62 and
                                            // 63
#define DDI_O_MASK16B01         0x00000200  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 0 and
                                            // 1
#define DDI_O_MASK16B23         0x00000204  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 2 and
                                            // 3
#define DDI_O_MASK16B45         0x00000208  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 4 and
                                            // 5
#define DDI_O_MASK16B67         0x0000020C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 6 and
                                            // 7
#define DDI_O_MASK16B89         0x00000210  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 8 and
                                            // 9
#define DDI_O_MASK16B1011       0x00000214  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 10 and
                                            // 11
#define DDI_O_MASK16B1213       0x00000218  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 12 and
                                            // 13
#define DDI_O_MASK16B1415       0x0000021C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 14 and
                                            // 15
#define DDI_O_MASK16B1617       0x00000220  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 16 and
                                            // 17
#define DDI_O_MASK16B1819       0x00000224  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 18 and
                                            // 19
#define DDI_O_MASK16B2021       0x00000228  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 20 and
                                            // 21
#define DDI_O_MASK16B2223       0x0000022C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 22 and
                                            // 23
#define DDI_O_MASK16B2425       0x00000230  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 24 and
                                            // 25
#define DDI_O_MASK16B2627       0x00000234  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 26 and
                                            // 27
#define DDI_O_MASK16B2829       0x00000238  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 28 and
                                            // 29
#define DDI_O_MASK16B3031       0x0000023C  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 30 and
                                            // 31
#define DDI_O_MASK16B3233       0x00000240  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 32 and
                                            // 33
#define DDI_O_MASK16B3435       0x00000244  // Masked access (16m/16d) for DDI
                                            // Registers at byte offsets 34 and
                                            // 35
#define DDI_O_MASK16B3637       0x00000248  // Masked access (16m/16d) for DDI
