hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/RF_LIB/inc/hw_ddi.h
#define DDI_CLR3235_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 32
#define DDI_CLR3235_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR3639 register.
//
//*****************************************************************************
#define DDI_CLR3639_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 39
#define DDI_CLR3639_S3_S        24
#define DDI_CLR3639_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 38
#define DDI_CLR3639_S2_S        16
#define DDI_CLR3639_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 37
#define DDI_CLR3639_S1_S        8
#define DDI_CLR3639_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 36
#define DDI_CLR3639_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR4043 register.
//
//*****************************************************************************
#define DDI_CLR4043_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 43
#define DDI_CLR4043_S3_S        24
#define DDI_CLR4043_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 42
#define DDI_CLR4043_S2_S        16
#define DDI_CLR4043_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 41
#define DDI_CLR4043_S1_S        8
#define DDI_CLR4043_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 40
#define DDI_CLR4043_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR4447 register.
//
//*****************************************************************************
#define DDI_CLR4447_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 47
#define DDI_CLR4447_S3_S        24
#define DDI_CLR4447_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 46
#define DDI_CLR4447_S2_S        16
#define DDI_CLR4447_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 45
#define DDI_CLR4447_S1_S        8
#define DDI_CLR4447_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 44
#define DDI_CLR4447_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR4851 register.
//
//*****************************************************************************
#define DDI_CLR4851_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 51
#define DDI_CLR4851_S3_S        24
#define DDI_CLR4851_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 50
#define DDI_CLR4851_S2_S        16
#define DDI_CLR4851_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 49
#define DDI_CLR4851_S1_S        8
#define DDI_CLR4851_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 48
#define DDI_CLR4851_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR5255 register.
//
//*****************************************************************************
#define DDI_CLR5255_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 55
#define DDI_CLR5255_S3_S        24
#define DDI_CLR5255_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 54
#define DDI_CLR5255_S2_S        16
#define DDI_CLR5255_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 53
#define DDI_CLR5255_S1_S        8
#define DDI_CLR5255_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 52
#define DDI_CLR5255_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR5659 register.
//
//*****************************************************************************
#define DDI_CLR5659_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 59
#define DDI_CLR5659_S3_S        24
#define DDI_CLR5659_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 58
#define DDI_CLR5659_S2_S        16
#define DDI_CLR5659_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 57
#define DDI_CLR5659_S1_S        8
#define DDI_CLR5659_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 56
#define DDI_CLR5659_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR6063 register.
//
//*****************************************************************************
#define DDI_CLR6063_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 63
#define DDI_CLR6063_S3_S        24
#define DDI_CLR6063_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 62
#define DDI_CLR6063_S2_S        16
#define DDI_CLR6063_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 61
#define DDI_CLR6063_S1_S        8
#define DDI_CLR6063_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 60
#define DDI_CLR6063_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK4B01 register.
//
//*****************************************************************************
#define DDI_MASK4B01_M1H_M      0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 1
#define DDI_MASK4B01_M1H_S      28
#define DDI_MASK4B01_D1H_M      0x0F000000  // Data for bits [7:4] in DDI
                                            // register 1, - only bits selected
                                            // by mask M1H will be affected by
                                            // access
#define DDI_MASK4B01_D1H_S      24
#define DDI_MASK4B01_M1L_M      0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 1
#define DDI_MASK4B01_M1L_S      20
#define DDI_MASK4B01_D1L_M      0x000F0000  // Data for bits [3:0] in DDI
                                            // register 1, - only bits selected
                                            // by mask M1L will be affected by
                                            // access
#define DDI_MASK4B01_D1L_S      16
#define DDI_MASK4B01_M0H_M      0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 0
#define DDI_MASK4B01_M0H_S      12
#define DDI_MASK4B01_D0H_M      0x00000F00  // Data for bits [7:4] in DDI
                                            // register 0, - only bits selected
                                            // by mask M0H will be affected by
                                            // access
#define DDI_MASK4B01_D0H_S      8
#define DDI_MASK4B01_M0L_M      0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 0
#define DDI_MASK4B01_M0L_S      4
#define DDI_MASK4B01_D0L_M      0x0000000F  // Data for bits [3:0] in DDI
                                            // register 0, - only bits selected
                                            // by mask M0L will be affected by
                                            // access
#define DDI_MASK4B01_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK4B23 register.
//
//*****************************************************************************
#define DDI_MASK4B23_M1H_M      0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 3
#define DDI_MASK4B23_M1H_S      28
#define DDI_MASK4B23_D1H_M      0x0F000000  // Data for bits [7:4] in DDI
                                            // register 3, - only bits selected
                                            // by mask M1H will be affected by
                                            // access
#define DDI_MASK4B23_D1H_S      24
#define DDI_MASK4B23_M1L_M      0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 3
#define DDI_MASK4B23_M1L_S      20
#define DDI_MASK4B23_D1L_M      0x000F0000  // Data for bits [3:0] in DDI
                                            // register 3, - only bits selected
                                            // by mask M1L will be affected by
                                            // access
#define DDI_MASK4B23_D1L_S      16
#define DDI_MASK4B23_M0H_M      0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 2
#define DDI_MASK4B23_M0H_S      12
#define DDI_MASK4B23_D0H_M      0x00000F00  // Data for bits [7:4] in DDI
                                            // register 2, - only bits selected
                                            // by mask M0H will be affected by
                                            // access
#define DDI_MASK4B23_D0H_S      8
#define DDI_MASK4B23_M0L_M      0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 2
#define DDI_MASK4B23_M0L_S      4
#define DDI_MASK4B23_D0L_M      0x0000000F  // Data for bits [3:0] in DDI
                                            // register 2, - only bits selected
                                            // by mask M0L will be affected by
                                            // access
#define DDI_MASK4B23_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK4B45 register.
//
//*****************************************************************************
#define DDI_MASK4B45_M1H_M      0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 5
#define DDI_MASK4B45_M1H_S      28
#define DDI_MASK4B45_D1H_M      0x0F000000  // Data for bits [7:4] in DDI
                                            // register 5, - only bits selected
                                            // by mask M1H will be affected by
                                            // access
#define DDI_MASK4B45_D1H_S      24
#define DDI_MASK4B45_M1L_M      0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 5
#define DDI_MASK4B45_M1L_S      20
#define DDI_MASK4B45_D1L_M      0x000F0000  // Data for bits [3:0] in DDI
                                            // register 5, - only bits selected
                                            // by mask M1L will be affected by
                                            // access
#define DDI_MASK4B45_D1L_S      16
#define DDI_MASK4B45_M0H_M      0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 4
#define DDI_MASK4B45_M0H_S      12
#define DDI_MASK4B45_D0H_M      0x00000F00  // Data for bits [7:4] in DDI
                                            // register 4, - only bits selected
                                            // by mask M0H will be affected by
                                            // access
#define DDI_MASK4B45_D0H_S      8
#define DDI_MASK4B45_M0L_M      0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 4
#define DDI_MASK4B45_M0L_S      4
#define DDI_MASK4B45_D0L_M      0x0000000F  // Data for bits [3:0] in DDI
                                            // register 4, - only bits selected
                                            // by mask M0L will be affected by
                                            // access
#define DDI_MASK4B45_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK4B67 register.
//
//*****************************************************************************
#define DDI_MASK4B67_M1H_M      0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 7
#define DDI_MASK4B67_M1H_S      28
#define DDI_MASK4B67_D1H_M      0x0F000000  // Data for bits [7:4] in DDI
                                            // register 7, - only bits selected
                                            // by mask M1H will be affected by
                                            // access
#define DDI_MASK4B67_D1H_S      24
#define DDI_MASK4B67_M1L_M      0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 7
#define DDI_MASK4B67_M1L_S      20
#define DDI_MASK4B67_D1L_M      0x000F0000  // Data for bits [3:0] in DDI
                                            // register 7, - only bits selected
                                            // by mask M1L will be affected by
                                            // access
#define DDI_MASK4B67_D1L_S      16
#define DDI_MASK4B67_M0H_M      0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 6
#define DDI_MASK4B67_M0H_S      12
#define DDI_MASK4B67_D0H_M      0x00000F00  // Data for bits [7:4] in DDI
                                            // register 6, - only bits selected
                                            // by mask M0H will be affected by
                                            // access
#define DDI_MASK4B67_D0H_S      8
#define DDI_MASK4B67_M0L_M      0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 6
#define DDI_MASK4B67_M0L_S      4
#define DDI_MASK4B67_D0L_M      0x0000000F  // Data for bits [3:0] in DDI
                                            // register 6, - only bits selected
                                            // by mask M0L will be affected by
                                            // access
#define DDI_MASK4B67_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK4B89 register.
//
//*****************************************************************************
#define DDI_MASK4B89_M1H_M      0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 9
#define DDI_MASK4B89_M1H_S      28
#define DDI_MASK4B89_D1H_M      0x0F000000  // Data for bits [7:4] in DDI
                                            // register 9, - only bits selected
                                            // by mask M1H will be affected by
                                            // access
#define DDI_MASK4B89_D1H_S      24
#define DDI_MASK4B89_M1L_M      0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 9
#define DDI_MASK4B89_M1L_S      20
#define DDI_MASK4B89_D1L_M      0x000F0000  // Data for bits [3:0] in DDI
                                            // register 9, - only bits selected
                                            // by mask M1L will be affected by
                                            // access
#define DDI_MASK4B89_D1L_S      16
#define DDI_MASK4B89_M0H_M      0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 8
#define DDI_MASK4B89_M0H_S      12
#define DDI_MASK4B89_D0H_M      0x00000F00  // Data for bits [7:4] in DDI
                                            // register 8, - only bits selected
                                            // by mask M0H will be affected by
                                            // access
#define DDI_MASK4B89_D0H_S      8
#define DDI_MASK4B89_M0L_M      0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 8
#define DDI_MASK4B89_M0L_S      4
#define DDI_MASK4B89_D0L_M      0x0000000F  // Data for bits [3:0] in DDI
                                            // register 8, - only bits selected
                                            // by mask M0L will be affected by
                                            // access
#define DDI_MASK4B89_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B1011 register.
//
//*****************************************************************************
#define DDI_MASK4B1011_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 11
#define DDI_MASK4B1011_M1H_S    28
#define DDI_MASK4B1011_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 11, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B1011_D1H_S    24
#define DDI_MASK4B1011_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 11
#define DDI_MASK4B1011_M1L_S    20
#define DDI_MASK4B1011_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 11, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B1011_D1L_S    16
#define DDI_MASK4B1011_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 10
#define DDI_MASK4B1011_M0H_S    12
#define DDI_MASK4B1011_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 10, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B1011_D0H_S    8
#define DDI_MASK4B1011_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 10
#define DDI_MASK4B1011_M0L_S    4
#define DDI_MASK4B1011_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 10, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B1011_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B1213 register.
//
//*****************************************************************************
#define DDI_MASK4B1213_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 13
#define DDI_MASK4B1213_M1H_S    28
#define DDI_MASK4B1213_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 13, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B1213_D1H_S    24
#define DDI_MASK4B1213_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 13
#define DDI_MASK4B1213_M1L_S    20
#define DDI_MASK4B1213_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 13, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B1213_D1L_S    16
#define DDI_MASK4B1213_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 12
#define DDI_MASK4B1213_M0H_S    12
#define DDI_MASK4B1213_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 12, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B1213_D0H_S    8
#define DDI_MASK4B1213_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 12
#define DDI_MASK4B1213_M0L_S    4
#define DDI_MASK4B1213_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
