hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/RF_LIB/inc/hw_ddi.h
#define DDI_MASK8B3233_M0_M     0x0000FF00  // Mask for DDI register 32
#define DDI_MASK8B3233_M0_S     8
#define DDI_MASK8B3233_D0_M     0x000000FF  // Data for DDI register 32, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B3233_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B3435 register.
//
//*****************************************************************************
#define DDI_MASK8B3435_M1_M     0xFF000000  // Mask for DDI register 35
#define DDI_MASK8B3435_M1_S     24
#define DDI_MASK8B3435_D1_M     0x00FF0000  // Data for DDI register 35, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B3435_D1_S     16
#define DDI_MASK8B3435_M0_M     0x0000FF00  // Mask for DDI register 34
#define DDI_MASK8B3435_M0_S     8
#define DDI_MASK8B3435_D0_M     0x000000FF  // Data for DDI register 34, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B3435_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B3637 register.
//
//*****************************************************************************
#define DDI_MASK8B3637_M1_M     0xFF000000  // Mask for DDI register 37
#define DDI_MASK8B3637_M1_S     24
#define DDI_MASK8B3637_D1_M     0x00FF0000  // Data for DDI register 37, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B3637_D1_S     16
#define DDI_MASK8B3637_M0_M     0x0000FF00  // Mask for DDI register 36
#define DDI_MASK8B3637_M0_S     8
#define DDI_MASK8B3637_D0_M     0x000000FF  // Data for DDI register 36, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B3637_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B3839 register.
//
//*****************************************************************************
#define DDI_MASK8B3839_M1_M     0xFF000000  // Mask for DDI register 39
#define DDI_MASK8B3839_M1_S     24
#define DDI_MASK8B3839_D1_M     0x00FF0000  // Data for DDI register 39, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B3839_D1_S     16
#define DDI_MASK8B3839_M0_M     0x0000FF00  // Mask for DDI register 38
#define DDI_MASK8B3839_M0_S     8
#define DDI_MASK8B3839_D0_M     0x000000FF  // Data for DDI register 38, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B3839_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B4041 register.
//
//*****************************************************************************
#define DDI_MASK8B4041_M1_M     0xFF000000  // Mask for DDI register 41
#define DDI_MASK8B4041_M1_S     24
#define DDI_MASK8B4041_D1_M     0x00FF0000  // Data for DDI register 41, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B4041_D1_S     16
#define DDI_MASK8B4041_M0_M     0x0000FF00  // Mask for DDI register 40
#define DDI_MASK8B4041_M0_S     8
#define DDI_MASK8B4041_D0_M     0x000000FF  // Data for DDI register 40, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B4041_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B4243 register.
//
//*****************************************************************************
#define DDI_MASK8B4243_M1_M     0xFF000000  // Mask for DDI register 43
#define DDI_MASK8B4243_M1_S     24
#define DDI_MASK8B4243_D1_M     0x00FF0000  // Data for DDI register 43, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B4243_D1_S     16
#define DDI_MASK8B4243_M0_M     0x0000FF00  // Mask for DDI register 42
#define DDI_MASK8B4243_M0_S     8
#define DDI_MASK8B4243_D0_M     0x000000FF  // Data for DDI register 42, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B4243_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B4445 register.
//
//*****************************************************************************
#define DDI_MASK8B4445_M1_M     0xFF000000  // Mask for DDI register 45
#define DDI_MASK8B4445_M1_S     24
#define DDI_MASK8B4445_D1_M     0x00FF0000  // Data for DDI register 45, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B4445_D1_S     16
#define DDI_MASK8B4445_M0_M     0x0000FF00  // Mask for DDI register 44
#define DDI_MASK8B4445_M0_S     8
#define DDI_MASK8B4445_D0_M     0x000000FF  // Data for DDI register 44, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B4445_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B4647 register.
//
//*****************************************************************************
#define DDI_MASK8B4647_M1_M     0xFF000000  // Mask for DDI register 47
#define DDI_MASK8B4647_M1_S     24
#define DDI_MASK8B4647_D1_M     0x00FF0000  // Data for DDI register 47, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B4647_D1_S     16
#define DDI_MASK8B4647_M0_M     0x0000FF00  // Mask for DDI register 46
#define DDI_MASK8B4647_M0_S     8
#define DDI_MASK8B4647_D0_M     0x000000FF  // Data for DDI register 46, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B4647_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B4849 register.
//
//*****************************************************************************
#define DDI_MASK8B4849_M1_M     0xFF000000  // Mask for DDI register 49
#define DDI_MASK8B4849_M1_S     24
#define DDI_MASK8B4849_D1_M     0x00FF0000  // Data for DDI register 49, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B4849_D1_S     16
#define DDI_MASK8B4849_M0_M     0x0000FF00  // Mask for DDI register 48
#define DDI_MASK8B4849_M0_S     8
#define DDI_MASK8B4849_D0_M     0x000000FF  // Data for DDI register 48, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B4849_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B5051 register.
//
//*****************************************************************************
#define DDI_MASK8B5051_M1_M     0xFF000000  // Mask for DDI register 51
#define DDI_MASK8B5051_M1_S     24
#define DDI_MASK8B5051_D1_M     0x00FF0000  // Data for DDI register 51, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B5051_D1_S     16
#define DDI_MASK8B5051_M0_M     0x0000FF00  // Mask for DDI register 50
#define DDI_MASK8B5051_M0_S     8
#define DDI_MASK8B5051_D0_M     0x000000FF  // Data for DDI register 50, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B5051_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B5253 register.
//
//*****************************************************************************
#define DDI_MASK8B5253_M1_M     0xFF000000  // Mask for DDI register 53
#define DDI_MASK8B5253_M1_S     24
#define DDI_MASK8B5253_D1_M     0x00FF0000  // Data for DDI register 53, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B5253_D1_S     16
#define DDI_MASK8B5253_M0_M     0x0000FF00  // Mask for DDI register 52
#define DDI_MASK8B5253_M0_S     8
#define DDI_MASK8B5253_D0_M     0x000000FF  // Data for DDI register 52, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B5253_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B5455 register.
//
//*****************************************************************************
#define DDI_MASK8B5455_M1_M     0xFF000000  // Mask for DDI register 55
#define DDI_MASK8B5455_M1_S     24
#define DDI_MASK8B5455_D1_M     0x00FF0000  // Data for DDI register 55, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B5455_D1_S     16
#define DDI_MASK8B5455_M0_M     0x0000FF00  // Mask for DDI register 54
#define DDI_MASK8B5455_M0_S     8
#define DDI_MASK8B5455_D0_M     0x000000FF  // Data for DDI register 54, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B5455_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B5657 register.
//
//*****************************************************************************
#define DDI_MASK8B5657_M1_M     0xFF000000  // Mask for DDI register 57
#define DDI_MASK8B5657_M1_S     24
#define DDI_MASK8B5657_D1_M     0x00FF0000  // Data for DDI register 57, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B5657_D1_S     16
#define DDI_MASK8B5657_M0_M     0x0000FF00  // Mask for DDI register 56
#define DDI_MASK8B5657_M0_S     8
#define DDI_MASK8B5657_D0_M     0x000000FF  // Data for DDI register 56, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B5657_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B5859 register.
//
//*****************************************************************************
#define DDI_MASK8B5859_M1_M     0xFF000000  // Mask for DDI register 59
#define DDI_MASK8B5859_M1_S     24
#define DDI_MASK8B5859_D1_M     0x00FF0000  // Data for DDI register 59, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B5859_D1_S     16
#define DDI_MASK8B5859_M0_M     0x0000FF00  // Mask for DDI register 58
#define DDI_MASK8B5859_M0_S     8
#define DDI_MASK8B5859_D0_M     0x000000FF  // Data for DDI register 58, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B5859_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B6061 register.
//
//*****************************************************************************
#define DDI_MASK8B6061_M1_M     0xFF000000  // Mask for DDI register 61
#define DDI_MASK8B6061_M1_S     24
#define DDI_MASK8B6061_D1_M     0x00FF0000  // Data for DDI register 61, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B6061_D1_S     16
#define DDI_MASK8B6061_M0_M     0x0000FF00  // Mask for DDI register 60
#define DDI_MASK8B6061_M0_S     8
#define DDI_MASK8B6061_D0_M     0x000000FF  // Data for DDI register 60, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B6061_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B6263 register.
//
//*****************************************************************************
#define DDI_MASK8B6263_M1_M     0xFF000000  // Mask for DDI register 63
#define DDI_MASK8B6263_M1_S     24
#define DDI_MASK8B6263_D1_M     0x00FF0000  // Data for DDI register 63, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B6263_D1_S     16
#define DDI_MASK8B6263_M0_M     0x0000FF00  // Mask for DDI register 62
#define DDI_MASK8B6263_M0_S     8
#define DDI_MASK8B6263_D0_M     0x000000FF  // Data for DDI register 62, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B6263_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B01 register.
//
//*****************************************************************************
#define DDI_MASK16B01_M_M       0xFFFF0000  // Mask for DDI register 0 and 1
#define DDI_MASK16B01_M_S       16
#define DDI_MASK16B01_D_M       0x0000FFFF  // Data for DDI register at
                                            // offsets 0 and 1, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B01_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B23 register.
//
//*****************************************************************************
#define DDI_MASK16B23_M_M       0xFFFF0000  // Mask for DDI register 2 and 3
#define DDI_MASK16B23_M_S       16
#define DDI_MASK16B23_D_M       0x0000FFFF  // Data for DDI register at
                                            // offsets 2 and 3, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B23_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B45 register.
//
//*****************************************************************************
#define DDI_MASK16B45_M_M       0xFFFF0000  // Mask for DDI register 4 and 5
#define DDI_MASK16B45_M_S       16
#define DDI_MASK16B45_D_M       0x0000FFFF  // Data for DDI register at
                                            // offsets 4 and 5, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B45_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B67 register.
//
//*****************************************************************************
#define DDI_MASK16B67_M_M       0xFFFF0000  // Mask for DDI register 6 and 7
#define DDI_MASK16B67_M_S       16
#define DDI_MASK16B67_D_M       0x0000FFFF  // Data for DDI register at
                                            // offsets 6 and 7, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B67_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B89 register.
//
//*****************************************************************************
#define DDI_MASK16B89_M_M       0xFFFF0000  // Mask for DDI register 8 and 9
#define DDI_MASK16B89_M_S       16
#define DDI_MASK16B89_D_M       0x0000FFFF  // Data for DDI register at
                                            // offsets 8 and 9, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B89_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B1011 register.
//
//*****************************************************************************
#define DDI_MASK16B1011_M_M     0xFFFF0000  // Mask for DDI register 10 and 11
#define DDI_MASK16B1011_M_S     16
#define DDI_MASK16B1011_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 10 and 11, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B1011_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B1213 register.
//
//*****************************************************************************
#define DDI_MASK16B1213_M_M     0xFFFF0000  // Mask for DDI register 12 and 13
#define DDI_MASK16B1213_M_S     16
#define DDI_MASK16B1213_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 12 and 13, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B1213_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B1415 register.
//
//*****************************************************************************
#define DDI_MASK16B1415_M_M     0xFFFF0000  // Mask for DDI register 14 and 15
#define DDI_MASK16B1415_M_S     16
#define DDI_MASK16B1415_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 14 and 15, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B1415_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B1617 register.
//
//*****************************************************************************
#define DDI_MASK16B1617_M_M     0xFFFF0000  // Mask for DDI register 16 and 17
#define DDI_MASK16B1617_M_S     16
#define DDI_MASK16B1617_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 16 and 17, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B1617_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B1819 register.
//
//*****************************************************************************
#define DDI_MASK16B1819_M_M     0xFFFF0000  // Mask for DDI register 18 and 19
#define DDI_MASK16B1819_M_S     16
#define DDI_MASK16B1819_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 18 and 19, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B1819_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2021 register.
//
//*****************************************************************************
#define DDI_MASK16B2021_M_M     0xFFFF0000  // Mask for DDI register 20 and 21
#define DDI_MASK16B2021_M_S     16
#define DDI_MASK16B2021_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 20 and 21, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B2021_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2223 register.
//
//*****************************************************************************
#define DDI_MASK16B2223_M_M     0xFFFF0000  // Mask for DDI register 22 and 23
#define DDI_MASK16B2223_M_S     16
#define DDI_MASK16B2223_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 22 and 23, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B2223_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2425 register.
//
//*****************************************************************************
#define DDI_MASK16B2425_M_M     0xFFFF0000  // Mask for DDI register 24 and 25
#define DDI_MASK16B2425_M_S     16
#define DDI_MASK16B2425_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 24 and 25, - only bits
                                            // selected by mask M will be
